app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-10 14:32:10.061873"], ["id", 1]]
---
  def update
    @target=Article.find(params[:id])
    @target.update(title: params[:title], description: params[:description])